app/controllers/banks_controller.rb

SELECT "banks".* FROM "banks"
---
  def index
    @banks = Bank.all