app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
  def index
    @conversations = Conversation.all

INSERT INTO "conversations" ("sender_id", "helper_id", "comments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sender_id", 1], ["helper_id", 2], ["comments", "3"], ["created_at", "2018-05-21 02:19:43.484961"], ["updated_at", "2018-05-21 02:19:43.484961"]]
---
  def create
    @conversation = Conversation.new(conversation_params)

    respond_to do |format|
      if @conversation.save

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def set_conversation
      @conversation = Conversation.find(params[:id])