app/controllers/transaction_records_controller.rb

  def index
    @transaction_records = TransactionRecord.all
---
SELECT "transaction_records".* FROM "transaction_records"

  def create
    @transaction_record = TransactionRecord.new(transaction_record_params)

    respond_to do |format|
      if @transaction_record.save
---
INSERT INTO "transaction_records" ("provider_id", "reciver_id", "credit", "review", "comments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["provider_id", 1], ["reciver_id", 2], ["credit", 4], ["review", 1], ["comments", "asasas"], ["created_at", "2018-05-18 02:47:09.643435"], ["updated_at", "2018-05-18 02:47:09.643435"]]

  def update
    respond_to do |format|
      if @transaction_record.update(transaction_record_params)
---
UPDATE "transaction_records" SET "provider_id" = $1, "updated_at" = $2 WHERE "transaction_records"."id" = $3  [["provider_id", 3], ["updated_at", "2018-05-18 02:58:33.547201"], ["id", 3]]

    def set_transaction_record
      @transaction_record = TransactionRecord.find(params[:id])
---
SELECT  "transaction_records".* FROM "transaction_records" WHERE "transaction_records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]