app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    $helper = @user.id
    $provider = $helper
    @transaction_record = TransactionRecord.all

    @conversation = Conversation.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "transaction_records".* FROM "transaction_records"
SELECT "conversations".* FROM "conversations"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "address", "skill", "image", "longitude", "latitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["address", "Sydney Australia\r\n"], ["latitude", -33.8688197], ["longitude", 151.2092955], ["updated_at", "2018-05-18 05:56:17.190381"], ["id", 8]]